package com.binyouwei.common.base

import android.app.Application
import com.binyouwei.common.utils.DataStoreUtils
import com.orhanobut.logger.Logger

/*
 * Copyright (c) 2022, smuyyh@gmail.com All Rights Reserved.
 * #                                                   #
 * #                       _oo0oo_                     #
 * #                      o8888888o                    #
 * #                      88" . "88                    #
 * #                      (| -_- |)                    #
 * #                      0\  =  /0                    #
 * #                    ___/`---'\___                  #
 * #                  .' \\|     |# '.                 #
 * #                 / \\|||  :  |||# \                #
 * #                / _||||| -:- |||||- \              #
 * #               |   | \\\  -  #/ |   |              #
 * #               | \_|  ''\---/''  |_/ |             #
 * #               \  .-\__  '-'  ___/-. /             #
 * #             ___'. .'  /--.--\  `. .'___           #
 * #          ."" '<  `.___\_<|>_/___.' >' "".         #
 * #         | | :  `- \`.;`\ _ /`;.`/ - ` : | |       #
 * #         \  \ `_.   \_ __\ /__ _/   .-` /  /       #
 * #     =====`-.____`.___ \_____/___.-`___.-'=====    #
 * #                       `=---='                     #
 * #     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   #
 * #                                                   #
 * #               佛祖保佑         永无BUG            #
 * #                                                   #
 */

/**
 * @author 宾有为
 * 创建时间：2023/7/2 8:08
 * CSDN：https://blog.csdn.net/baidu_41616022?spm=1000.2115.3001.5343
 * 项目名称：WanAndroid-Compose
 * 项目源码：https://gitcode.net/baidu_41616022/wanandroid-compose
 * 文件包名：com.binyouwei
 */
open class BaseApplication : Application() {

    override fun onCreate() {
        super.onCreate()
        Logger.i(" ......................阿弥陀佛......................\n"+
                            "                       _oo0oo_                      \n"+
                            "                      o8888888o                     \n"+
                            "                      88\" . \"88                     \n"+
                            "                      (| -_- |)                     \n"+
                            "                      0\\  =  /0                     \n"+
                            "                   ___/‘---’\\___                   \n"+
                            "                  .' \\|       |/ '.                 \n"+
                            "                 / \\\\|||  :  |||// \\                \n"+
                            "                / _||||| -卍-|||||_ \\               \n"+
                            "               |   | \\\\\\  -  /// |   |              \n"+
                            "               | \\_|  ''\\---/''  |_/ |              \n"+
                            "               \\  .-\\__  '-'  ___/-. /              \n"+
                            "             ___'. .'  /--.--\\  '. .'___            \n"+
                            "         .\"\" ‘<  ‘.___\\_<|>_/___.’>’ \"\".          \n"+
                            "       | | :  ‘- \\‘.;‘\\ _ /’;.’/ - ’ : | |        \n"+
                            "         \\  \\ ‘_.   \\_ __\\ /__ _/   .-’ /  /        \n"+
                            "    =====‘-.____‘.___ \\_____/___.-’___.-’=====     \n"+
                            "                       ‘=---=’                      \n"+
                            "                                                    \n"+
                            "....................佛祖保佑 ,永无BUG...................")
        DataStoreUtils.init(this)
    }
}